tutorials/fishLader/constant/fishProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhop rhop [ 1 -3 0 0 0 0 0] 1000;
e e [ 0 0 0 0 0 0 0] 0.8; //Shifted for copy-paste reasons
mu mu [ 0 0 0 0 0 0 0] 0.2; //Shifted for copy-paste reasons

// ************************************************************************* //
