tutorials/fishLader/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    ( 0  -50   0) // 0
    (100 -50   0) // 1
    ( 0  -25   0) // 2
    (100 -25   0) // 3
    ( 0   25   0) // 4
    (100  25   0) // 5
    ( 0   50   0) // 6
    (100  50   0) // 7

    ( 0  -50  70) // 8
    (100 -50  70) // 9
    ( 0  -25  70) // 10
    (100 -25  70) // 11
    ( 0   25  70) // 12
    (100  25  70) // 13
    ( 0   50  70) // 14
    (100  50  70) // 15
);

blocks
(
    hex (0 1 3 2  8  9 11 10) (5  3 10) simpleGrading (1 1 1)
    hex (2 3 5 4 10 11 13 12) (5  5 10) simpleGrading (1 1 1)
    hex (4 5 7 6 12 13 15 14) (5  3 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 3 2)
            (4 5 7 6)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (2 3 5 4)
            (0 1 9 8)
            (0 2 10 8)
            (1 3 11 9)
            (2 4 12 10)
            (5 7 15 13)
            (6 7 15 14)
            (4 6 14 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 5 13 11)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8  9 11 10)
            (10 11 13 12)
            (12 13 15 14)
        );
    }
);

// ************************************************************************* //
